package com.ibm;

/*
 請設計一印出”省略九九乘法表”的程式，類別為 com.ibm.NineLazy類別執行後印出以下結果： 
 (10分)請注意，”…”一定要印出來
2*1= 2 3*1= 3 4*1= 4 5*1= 5 6*1= 6 7*1= 7 8*1= 8 9*1= 9 
2*2= 4 3*2= 6 4*2= 8 5*2=10 6*2=12 7*2=14 8*2=16 9*2=18 
2*3= 6 3*3= 9 4*3=12 5*3=15 6*3=18 7*3=21 8*3=24 9*3=27
...    ...    ...    ...    ...    ...    ...    ...
...    ...    ...    ...    ...    ...    ...    ...
...    ...    ...    ...    ...    ...    ...    ...
...    ...    ...    ...    ...    ...    ...    ...
...    ...    ...    ...    ...    ...    ...    ...
2*9=18 3*9=27 4*9=36 5*9=45 6*9=54 7*9=63 8*9=72 9*9=81

 */
//處理完了!!!
// 程式只能印橫的,不可以用我想要用的方式

public class NineLazy {

	public static void main(String[] args) {
		for (int n = 1; n < 10; n++) {
			for (int i = 2; i < 10; i++) {
				if (n > 4 && n < 9) {
					System.out.print("...");
					System.out.print("    ");
				} else { if(n*i<10){
					System.out.print(i + "*" + n + "= " + n * i + " ");
					}else{
					System.out.print(i + "*" + n + "=" + n * i + " ");
				}
					
				}
			}
			System.out.println();
		}

	}
}
